Tekla.Structures.Drawing.DrawingObject.SetView(Tekla.Structures.Drawing.ViewBase)
Set view to which the drawing object belongs
Returns:

Tekla.Structures.Drawing.DrawingObject.QueryUserPropertySet(System.String,Tekla.Structures.DrawingInternal.dotGrUserProperty_t@)


Tekla.Structures.Drawing.DrawingObject.QueryUserPropertyGet(System.String,Tekla.Structures.DrawingInternal.dotGrUserProperty_t@)


Tekla.Structures.Drawing.DrawingObject.QueryReturnValue
Status information about the latest database operation (select, insert, modify, delete).